---
kind: method
id: M:Autodesk.Revit.DB.ExternalFileReference.GetPath
source: html/b2d03999-d2b7-7889-8939-3f994193448c.htm
---
# Autodesk.Revit.DB.ExternalFileReference.GetPath Method

Gets the path of the link, relative or absolute according
 to the link's settings

## Syntax (C#)
```csharp
public ModelPath GetPath()
```

## Returns
The path of the link. This path will be relative for
 relatively-pathed links.